[{
  "_id": {
    "$oid": "66dd4a89926404848ded71b7"
  },
  "name": "Diwali",
  "description": "Diwali, the festival of lights, is one of the most celebrated festivals in India. It symbolizes the victory of light over darkness and good over evil.",
  "image": "https://utsav.gov.in/public/festival_top/1659608853.jpg",
  "additionalInfo": "Diwali is the five-day Festival of Lights, celebrated by millions of Hindus, Sikhs and Jains across the world. Diwali is a festival of new beginnings and the triumph of good over evil and light over darkness, and for some also coincides with harvest and new year celebrations. So in most places in India, you have Naraka Chaturdasi to commemorate the killing of Narakasura, followed by Diwali where the lamps are lit and crackers burst. Diwali is celebrated because Lord Rama returned back to his kingdom of Ayodhya after his 14 year exile along with his Wife Sita maa and brother Lakshman. During this festival, people decorate their homes with lights and oil lamps, called diyas. 4) For many people, Diwali honours the Hindu goddess of wealth, Lakshmi. The lights and lamps are said to help Lakshmi find her way into peoples' homes, bringing prosperity in the year to come! Dhanteras, Naraka Chaturdasi, Lakshmi Puja, Govardhan Puja, and Bhai Dooj are the five days of Diwali. The first day of Diwali is called Dhanteras. On this day, it’s traditional to clean the family home. Many people also purchase items made from gold on this day. Those of the Hindu faith may also choose to honor Lakshmi, the goddess of wealth and fortune. Choti Diwali is the second day of the festival. This is a time for families to decorate their homes. The third day of Diwali is Lakshmi Puja. It is the main day of the festival, when clay lamps, candles, and fireworks are common sights throughout India. On day four, or Goverdhan Puja, people visit with friends and relatives. It’s common to trade gifts. In the Hindu tradition, this is also the first day of the new year. Finally, Bhai Dooj is the fifth day of Diwali. It is a celebration of the special bond that exists between siblings. Traditionally, adult brothers visit their sisters’ homes on this day, often bringing gifts. The sisters, in turn, may prepare a feast and pray for their brothers’ protection and well-being The colourful pattern known as a rangoli is created at each home's entrance. Rangolis are made on Diwali days to welcome Goddess Laxmi.",
  "state": "All States"
},
{
  "_id": {
    "$oid": "66dd4a89926404848ded71b8"
  },
  "name": "Holi",
  "description": "Holi, known as the festival of colors, celebrates the arrival of spring. It is marked by throwing colored powders and water at each other.",
  "image": "https://cdn.britannica.com/57/244757-131-EBAFDFE0/Hindu-Holi-Festival-Mathura-Uttar-Pradesh-India.jpg",
  "additionalInfo": "Holi is a popular and significant Hindu festival celebrated as the Festival of Colours, Love, and Spring. It celebrates the eternal and divine love of the deities Radha and Krishna. Additionally, the day signifies the triumph of good over evil, as it commemorates the victory of Vishnu as Narasimha over Hiranyakashipu. Holi originated and is predominantly celebrated in the Indian subcontinent, but has also spread to other regions of Asia and parts of the Western world through the Indian diaspora.\nHoli also celebrates the arrival of Spring in India, the end of winter, and the blossoming of love. It is also an invocation for a good spring harvest season. It lasts for a night and a day, starting on the evening of the Purnima (full moon day) falling on the Hindu calendar month of Phalguna, which falls around the middle of March in the Gregorian calendar. It is a cultural celebration that gives Hindus and non-Hindus alike an opportunity to have fun banter with other people by throwing coloured water and powder at each other. It is also observed broadly on the Indian subcontinent. Holi is celebrated at the end of winter, on the last full moon day of the Hindu luni-solar calendar month, marking the spring, making the date vary with the lunar cycle. The date falls typically in March, but sometimes late February of the Gregorian calendar.\nThe festival has many purposes; most prominently, it celebrates the beginning of Spring. In 17th century literature, it was identified as a festival that celebrated agriculture, commemorated good spring harvests, and the fertile land.[15] Hindus believe it is a time to enjoying spring's abundant colours and say farewell to winter. To many Hindus, Holi festivities mark an occasion to reset and renew ruptured relationships, end conflicts, and rid themselves of accumulated emotional impurities from the past. \nIt also has a religious purpose, symbolically signified by the legend of Holika. The night before Holi, bonfires are lit in a ceremony known as Holika Dahan (burning of Holika) or Little Holi. People gather near fires, sing and dance. The next day, Holi, also known as Dhuli in Sanskrit, or Dhulheti, Dhulandi or Dhulendi, is celebrated. \nIn Northern parts of India, children and youth spray coloured powder solutions (gulal) at each other, laugh, and celebrate, while adults smear dry coloured powder (abir) on each other's faces. Visitors to homes are first teased with colours, then served with Holi delicacies (such as gujia, shakkarpaare, matri, and dahi-bada), desserts and drinks. After playing with colours, and cleaning up, people bathe, put on clean clothes, and visit friends and family. \nLike Holika Dahan, Kama Dahanam is celebrated in some parts of India. The festival of colours in these parts is called Rangapanchami, and occurs on the fifth day after Poornima (full moon).",
  "state": "All States"
},
{
  "_id": {
    "$oid": "66dd4a89926404848ded71b9"
  },
  "name": "Durga Puja",
  "description": "Durga Puja is a Hindu festival celebrated to honor the goddess Durga. The festival is especially prominent in West Bengal.",
  "image": "https://sc0.blr1.cdn.digitaloceanspaces.com/article/195124-qvgkhmetzb-1697719180.jpg",
  "additionalInfo": "Durga Puja also known as Durgotsava or Sharodotsav, is an annual festival originating in the Indian subcontinent which reveres and pays homage to the Hindu goddess Durga, and is also celebrated because of Durga's victory over Mahishasura. It is particularly celebrated in the Eastern Indian states of West Bengal, Tripura, Bihar, Jharkhand, eastern Uttar Pradesh, Assam, Odisha and by Hindus in Bangladesh. The festival is observed in the Indian calendar in the month of Ashvin, which corresponds to September–October in the Gregorian calendar. Durga Puja is a ten-day festival, of which the last five are of the most significance. The puja is performed in homes and public, the latter featuring a temporary stage and structural decorations (known as pandals). The festival is also marked by scripture recitations, performance arts, revelry, gift-giving, family visits, feasting, and public processions called a melā. Durga Puja is an important festival in the Shaktism tradition of Hinduism. Durga Puja in Kolkata has been inscribed on the intangible cultural heritage list of UNESCO in December 2021. As per Hindu scriptures, the festival marks the victory of goddess Durga in her battle against the shape-shifting asura, Mahishasura. Thus, the festival epitomizes the victory of good over evil, though it is also in part a harvest festival celebrating the goddess as the motherly power behind all of life and creation. Durga Puja coincides with Navaratri and Dussehra celebrations observed by other traditions of Hinduism. he primary goddess revered during Durga Puja is Durga, but celebrations also include other major deities of Hinduism such as Lakshmi (the goddess of wealth and prosperity), Saraswati (the goddess of knowledge and music), Ganesha (the god of good beginnings), and Kartikeya (the god of war). In Bengali traditions, these deities are considered to be Durga's children, and Durga Puja is believed to commemorate Durga's visit to her natal home with her beloved children. The festival is preceded by Mahalaya, which is believed to mark the start of Durga's journey to her natal home. Primary celebrations begin on the sixth day (Shasthi), on which the goddess is welcomed with rituals. The festival ends on the tenth day (Vijaya Dashami), when devotees embark on a procession carrying the worshipped clay sculpture-idols to a river, or other water body, and immerse them, symbolic of her return to the divine cosmos and her marital home with Shiva in Kailash. Regional and community variations in celebration of the festival and rituals observed exist.",
  "state": "West Bengal"
},
{
  "_id": {
    "$oid": "66dd4a89926404848ded71ba"
  },
  "name": "Ganesh Chaturthi",
  "description": "Ganesh Chaturthi is celebrated in honor of the birth of Lord Ganesha. It is a major festival in Maharashtra and other parts of India.",
  "image": "https://m.economictimes.com/thumb/msid-93770377,width-1200,height-900,resizemode-4,imgsize-224790/lord-ganesha.jpg",
  "additionalInfo": "Ganesh Chaturthi also known as Vinayaka Chaturthi (Vināyaka Caturthī) or Vinayaka Chavithi (Vināyaka Cavithī) or Vinayagar Chaturthi (Vināyagar Caturthī), is a Hindu festival birthday of Hindu deity Ganesha.[1] The festival is marked with the installation of Ganesha's clay murtis (devotional representations of a deity) privately in homes and publicly on elaborate pandals (temporary stages). Observances include chanting of Vedic hymns and Hindu texts, such as prayers and vrata (fasting). Offerings and prasada from the daily prayers, that are distributed from the pandal to the community, include sweets such as modak as it is believed to be a favourite of Lord Ganesha.  In Mumbai alone, around 150,000 Murtis are immersed annually. Thereafter the clay Murti dissolves and Ganesha is believed to return to his celestial abode. On the same day, Chaurchan festival is celebrated in Mithila region of Bihar which is related to Ganesha and Chandra (Moon God). \nIn preparation for the festival, artisans create clay models of Ganesha for sale. The images (Murtis) range in size from 20 mm (3⁄4 in) for homes to over 20 m (70 ft) for large community celebrations. \nOn the last day of the festival, the tradition of Ganesh visarjan or nimajjanam (lit. \"immersion\") takes places, when the Ganesha images are immersed in a river, sea or water body. On the last day, the devotees come out in processions carrying the idols of Ganesha, culminating in immersion. It is believed that the god who comes to the earthly realm on Ganesh Chaturthi, returns to his celestial abode after immersion. The celebration of Ganesh Chaturthi also denotes the significance of the cycle of birth, life and death. It is believed that when the idol of the Ganesha is taken out for immersion, it also takes away with it the various obstacles of the house and these obstacles are destroyed along with the immersion. Every year, people wait with great anticipation to celebrate the festival of Ganesh Chaturthi. \n",
  "state": "Maharashtra"
},
{
  "_id": {
    "$oid": "66dd4a89926404848ded71bb"
  },
  "name": "Eid al-Fitr",
  "description": "Eid al-Fitr marks the end of Ramadan, the holy month of fasting for Muslims. It is a day of feasting and giving thanks.",
  "image": "https://static.toiimg.com/photo/64601704.cms",
  "additionalInfo": "Eid al-Fitr (/ˌiːd əl ˈfɪtər, -trə/ EED əl FIT-ər, -⁠rə; Arabic: عيد الفطر, romanized: ʿĪd al-Fiṭr, lit. 'Feast of Breaking the Fast', IPA: [ʕiːd al ˈfɪtˤr]) is the earlier of the two official holidays celebrated within Islam (the other being Eid al-Adha). Eid al-Fitr is celebrated by Muslims worldwide because it marks the end of the month-long dawn-to-dusk fasting of Ramadan.[4] Eid al-Fitr falls on the first day of Shawwal in the Islamic calendar; this does not always fall on the same Gregorian day, as the start of any lunar Hijri month varies based on when the new moon is sighted by local religious authorities. The holiday is known under various other names in different languages and countries around the world. The day is also called Eid I or \"Lesser Eid\" (Arabic: العيد الصغير, romanized: al-ʿĪd al-Ṣaghīr), or simply Eid. \nEid al-Fitr has a particular salah that consists of two rakats generally performed in an open field or large hall. It may only be performed in congregation (jamāʿat) and features seven additional Takbirs (raising of the hands to the ears whilst reciting the Takbir, saying \"Allāhu ʾAkbar\", meaning \"God is the greatest\"). In the Hanafi school of Sunni Islam, there are three Takbirs at the start of the first rakat and three just before rukūʿ in the second rakat. Other Sunni schools usually have 12 Takbirs, similarly split in groups of seven and five. In Shia Islam, the salat has six Takbirs in the first rakat at the end of Tilawa, before rukūʿ, and five in the second.[8] Depending on the juristic opinion of the locality, this salat is either farḍ (فرض, obligatory) or mustaḥabb (strongly recommended). After the salat, Muslims celebrate the Eid al-Fitr in various ways with food being a central theme, which also gives the holiday the nickname \"Sweet Eid\" or \"Sugar Feast\".\nEid al-Fitr begins at sunset on the night of the first sighting of the crescent moon. The night on which the moon is sighted is celebrated as Chand Raat. If the moon is not observed immediately after the 29th day of the previous lunar month (either because clouds block its view or because the western sky is still too bright when the moon sets), then the holiday is celebrated the following day. Eid al-Fitr is celebrated for one to three days, depending on the country. It is forbidden to fast on the Day of Eid, and a specific prayer is nominated for this day.[16] As an obligatory act of charity, money is paid to the poor and the needy (zakat al-Fitr) before performing the 'Eid prayer.’",
  "state": "All States"
},
{
  "_id": {
    "$oid": "66dd4a89926404848ded71bc"
  },
  "name": "Pongal",
  "description": "Pongal is a harvest festival celebrated in Tamil Nadu. It marks the end of the winter solstice and is dedicated to the Sun God.",
  "image": "https://s.w-x.co/in-pongal_0.jpg",
  "additionalInfo": "Pongal also referred to as Thai Pongal, is a multi-day Hindu harvest festival celebrated by Tamils. It is observed in the month of Thai according to the Tamil solar calendar and usually falls on 14 or 15 January. It is dedicated to Surya (the solar deity in Hinduism) and corresponds to Makar Sankranti, the Hindu observance celebrated under many regional names throughout the Indian subcontinent. The festival is celebrated over three or four days with Bhogi, Surya Pongal, Mattu Pongal and Kanum Pongal, observed on consecutive days.\nAccording to tradition, the festival marks the end of winter solstice, and the start of the sun's six-month-long journey northwards called Uttarayana when the sun enters Capricorn. The festival is named after the ceremonial \"Pongal\", which means \"to boil, overflow\" and refers to the traditional dish prepared from the new harvest of rice boiled in milk with jaggery. Mattu Pongal is meant for celebration of cattle when the cattle are bathed, their horns polished and painted in bright colors, garlands of flowers placed around their necks and processions. It is traditionally an occasion for decorating rice-powder based kolam artworks, offering prayers in the home, temples, getting together with family and friends, and exchanging gifts to renew social bonds of solidarity.\nPongal is one of the most important festivals celebrated by Tamil people in Tamil Nadu and other parts of South India. It is also a major Tamil festival in Sri Lanka and observed by the Tamil diaspora worldwide.\n",
  "state": "Tamil Nadu"
},
{
  "_id": {
    "$oid": "66dd4a89926404848ded71bd"
  },
  "name": "Baisakhi",
  "description": "Baisakhi marks the harvest of Rabi crops and is celebrated with great enthusiasm in Punjab. It is also an important day for Sikhs as it commemorates the formation of the Khalsa.",
  "image": "https://theunitedindian.com/images/Baisakhi-14-04-24-M-hero.webp",
  "additionalInfo": "Vaisakhi, also known as Baisakhi, marks the first day of the month of Vaisakh and is traditionally celebrated annually on 13 April and sometimes 14 April. It is seen as a spring harvest celebration primarily in Punjab and Northern India. Whilst it is culturally significant as a festival of harvest, in many parts of India, Vaisakhi is also the date for the Indian Solar New Year. \nFor Sikhs, in addition to its significance as the harvest festival, during which Sikhs hold kirtans, visit local gurdwaras, community fairs, hold nagar kirtan processions, raise the Nishan Sahib flag, and gather to socialize and share festive foods,[2][19][20] Vaisakhi observes major events in the history of Sikhism and the Indian subcontinent that happened in the Punjab region. Vaisakhi as a major Sikh festival marks the birth of the Khalsa order by Guru Gobind Singh, the tenth Guru of Sikhism, on 13 April 1699. This holiday is observed by Hindus and is known by various regional names in other parts of India. For many Hindu communities, the festival is an occasion to ritually bathe in sacred rivers such as Ganges, Jhelum, and Kaveri, visit temples, meet friends, take part in other festivities, and perform a mandatory daan (charity) especially of hand fans, water pitchers and seasonal fruits. Community fairs are held at Hindu pilgrimage sites. In many areas, processions of temple deities are taken out. The holiday also marks the worship and propitiation of various deities, such as Durga in Himachal Pradesh, Surya in Bihar, and Vishnu in southern India Although Vaisakhi began as a grain harvest festival for Hindus and its observance predates the creation of Sikhism, it gained historical association with the Sikhs following the inauguration of the Khalsa.\n",
  "state": "Punjab"
},
{
  "_id": {
    "$oid": "66dd4a89926404848ded71be"
  },
  "name": "Onam",
  "description": "Onam is the harvest festival of Kerala, celebrating the return of the mythical King Mahabali. It is marked by grand feasts, boat races, and traditional dance.",
  "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSMTrc5JgctBE7xVCetgwjwqXAPlWXY7KqSEQ&s",
  "additionalInfo": "Onam  is an annual harvest and cultural festival celebrated mostly by the people of Kerala. A major annual event for Keralites, it is the official festival of the state and includes a spectrum of cultural events. \nOnam commemorates Vamana (the fifth avatar of Hindu deity Vishnu) and the generous daitya king Mahabali. According to the Hindu legends, after Indra (the king of the devas) is defeated by Mahabali (the king of the asuras), the devas ultimately seek refuge in Vishnu, who agrees to restore Indra to power. To do so, Vishnu incarnates as a dwarf priest called Vamana. The king Mahabali (himself a devotee of Vishnu) conducts ritual prayers, one of which is attended by Vamana, who requests only three feet (steps) of land to build a fire-altar. Mahabali agrees, despite being told about Vamana's divine nature by the sage Shukra. Vamana grows in size, and in three strides, encompasses all of the universe and beyond. The three worlds are restored to Indra, and Mahabali and the asuras are banished to the netherworld (Patala). However, witnessing Mahabali's love for his subjects, Vamana grants the king's sole wish to visit his kingdom once every year. This homecoming of Mahabali is celebrated as Onam in Kerala every year. \nThe date of Onam celebration is based on the Panchangam, and falls on the 22nd nakshatra Thiruvonam in the month Chingam of Malayalam calendar, which in Gregorian calendar falls between August–September. \n",
  "state": "Kerala"
},
{
  "_id": {
    "$oid": "66dd4a89926404848ded71bf"
  },
  "name": "Navratri",
  "description": "Navratri is a nine-night festival that celebrates the goddess Durga in her nine forms. It is especially popular in Gujarat and West Bengal.",
  "image": "https://www.gujarattourism.com/content/dam/gujrattourism/images/home_page/Navratri.jpg",
  "additionalInfo": "The word Navaratri means \"nine nights\" in Sanskrit, nava meaning \"nine\" and ratri meaning \"nights\".\nIn the eastern and northeastern states of India, the Durga Puja is synonymous with Navaratri, wherein goddess Durga battles and emerges victorious over the buffalo demon Mahishasura to help restore dharma.[4] In southern states, the victory of Durga or Kali is celebrated. In the western state of Gujarat, Navaratri celebrations are constituted by arti, followed by garba. In all cases, the common theme is the battle and victory of good over evil based on a regionally famous epic or legend such as the Devi Mahatmya\nCelebrations include worshipping nine goddesses during nine days, stage decorations, recital of the legend, enacting of the story, and chanting of the scriptures of Hinduism. The nine days are also a major crop season cultural event, such as competitive design and staging of pandals, a family visit to these pandals, and the public celebration of classical and folk dances of Hindu culture.[6][7][8] Hindu devotees often celebrate Navaratri by fasting. On the final day, called Vijayadashami, the statues are either immersed in a water body such as a river or ocean, or the statue symbolising the evil is burnt with fireworks, marking the destruction of evil. During this time preparations also take place for Deepavali (the festival of lights) which is celebrated twenty days after Vijayadashami. According to some Hindu texts such as the Shakta and Vaishnava Puranas, Navaratri theoretically falls two or four times in a year. Of these, the Sharada Navaratri near the September equinox (the autumn equinox in September–October) is the most celebrated and the Vasanta Navaratri near the March equinox (the spring equinox in March–April) is the next most significant to the culture of the Indian subcontinent. In all cases, Navaratri falls in the bright half (waxing phase) of the Hindu lunisolar months. The celebrations vary by region, leaving much to the creativity and preferences of the Hindu.",
  "state": "Gujarat"
},
{
  "_id": {
    "$oid": "66dd4a89926404848ded71c0"
  },
  "name": "Christmas",
  "description": "Christmas is celebrated to mark the birth of Jesus Christ. It is a widely observed festival in India, especially in regions with Christian communities.",
  "image": "https://i0.wp.com/www.tusktravel.com/blog/wp-content/uploads/2019/10/Christmas-Celebrate-in-India.jpg?w=1200&ssl=1",
  "additionalInfo": "Christmas is a popular holiday celebrated on December 25th each year, commemorating the birth of Jesus Christ. It is marked by festive decorations, such as Christmas trees, lights, and ornaments. Many people exchange gifts, reflecting the spirit of giving. Traditional customs include family gatherings, festive meals, and singing Christmas carols. In various cultures, Santa Claus is a beloved figure who brings gifts to children. Religious services, like Midnight Mass, are also significant for many. Overall, Christmas embodies joy, love, and togetherness, transcending its religious roots to become a global celebration.\nChristmas is celebrated with a rich blend of traditions across the world. In many countries, the holiday season starts early in December, with Advent marking the weeks leading up to Christmas Day. Homes and streets are often adorned with twinkling lights, wreaths, and nativity scenes that depict the birth of Jesus. Special holiday foods are prepared, like roast turkey, ham, mince pies, and Christmas pudding, depending on regional customs. Children eagerly anticipate Christmas morning when they can open presents left under the tree or in stockings hung by the fireplace.\n\nMany communities hold festive parades, Christmas markets, and concerts that spread holiday cheer. The figure of Santa Claus, also known as St. Nicholas or Father Christmas in some cultures, adds magic to the season, with children writing letters to him, hoping for their wishes to come true. Acts of charity and kindness are encouraged during Christmas, with many people donating to those in need or volunteering their time to help others. The holiday's themes of peace, goodwill, and compassion resonate universally, making Christmas a season of joy, reflection, and connection for people worldwide.",
  "state": "All States"
}]